# yosys synthesis script
read_verilog src/hello.v
synth_ecp5 -json gen/hello.json -top hello

# Cell Assignment Statistics
tee -o gen/hello.cas stat

# Intermediate Synthesis Schematic (requires graphviz to render)
write_json gen/hello.iss.json
