# yosys synthesis script for GateMate FPGA
read_verilog src/hello.v
synth_gatemate -top hello -luttree -nomx8
write_json gen/hello.json
